app/Views/Usuarios/listadesactivarusuarios.php

SELECT *
FROM `usuario`
WHERE `Idusuario` = '1'
 LIMIT 1
---
                  <?php
                  $user = new Usuario();
                  $id = $usuario['Idusuario'];
                  $datosuser = $user->where('Idusuario', $id)->first();