app/Controllers/FormularioDeEditar.php

SELECT *
FROM `usuario`
ORDER BY `Idusuario` ASC
---
    public function editar($id = null)
    {

        $this->usuarios = new Usuario();
        $datos['user'] = null;
        $datos['usuarios'] = $this->usuarios->orderBy('Idusuario', 'ASC')->findAll();