app/Controllers/ListaDesactivarUsuarios.php

SELECT *
FROM `usuario`
ORDER BY `Idusuario` ASC
---
    public function index()
    {
        $this->usuario=new Usuario();
        $data['usuarios']=$this->usuario->orderBy('Idusuario','ASC')->findAll();