app/Controllers/Login.php

SELECT *
FROM `usuario`
ORDER BY `Idusuario` ASC
---
    public function validarIngreso()
    {
       $this->usuario=new Usuario();
        $datos['usuarios']=$this->usuario->orderBy('Idusuario','ASC')->findAll();