app/Controllers/Reporte.php

SELECT *
FROM `reportes`
ORDER BY `apellido` ASC
---
    public function index()
    {
        $model = new Reportes();
        $data['reportes'] = $model->orderBy('apellido', 'ASC')->findAll();