app/Controllers/Reporte.php

    public function index()
    {

        $model = new Reportes();

        $data['reportes'] = $model->orderBy('Idreporte', 'ASC')->findAll();
---
SELECT *
FROM `reportes`
ORDER BY `Idreporte` ASC

            }
        }

        $data['reportes'] = $model->orderBy('Idreporte', 'ASC')->findAll();
---
SELECT *
FROM `reportes`
WHERE `reportes`.`Idreporte` = '3'