app/Controllers/voluntarios.php

public function listarVoluntarios()
{
    // Instancia el modelo de voluntarios
    $voluntarioModel = new VoluntarioModel();

    // Selecciona los campos específicos que necesitas
    $data['voluntarios'] = $voluntarioModel
        ->select('voluntarios.*, dni_filiales.nombre_filial as nombre_oficina')
        ->join('dni_filiales', 'dni_filiales.id = voluntarios.id_oficina_v', 'left')
        ->orderBy('voluntarios.apellido_paterno_v', 'ASC')
        ->findAll();
---
SELECT `voluntarios`.*, `dni_filiales`.`nombre_filial` as `nombre_oficina`
FROM `voluntarios`
LEFT JOIN `dni_filiales` ON `dni_filiales`.`id` = `voluntarios`.`id_oficina_v`
ORDER BY `voluntarios`.`apellido_paterno_v` ASC